---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ToposolidStructureIdParam
source: html/22f8bf08-fb52-fd20-389a-0f76e805c7db.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ToposolidStructureIdParam Property

"Structure"

## Syntax (C#)
```csharp
public static ForgeTypeId ToposolidStructureIdParam { get; }
```